InformationRegisters/ДоступныеОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеОстаткиТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доступно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЗарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеЗапаса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗапаса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПотребности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактеристикиПотребности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаОтгрузку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПоступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемоеПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДоступности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипЗаписиРаспределенияЗапасов</Name>
					<Comment>Дополнительный разделитель для ускорения записи наборов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗапаса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗапаса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВНаличии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяКПоступлению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласованииПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбеспечен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВНаличииОжидаетсяРазблокировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВНаличииНеПодлежитРазблокировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяКПоступлениюСБлокировкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяКПоступлениюНеПодлежитРазблокировке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ДоступныеОстаткиТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Склад)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();

	// Регистр "Доступные остатки товаров" заполняется данным обработчиком по текущим данным регистра "Запасы и потребности". 
	// Если необходимо обновить данные в связи с обновлением данных в регистре "Запасы и потребности",
	// необходим отдельный обработчик более низкой очереди.
	
	Обработчик.Процедура = "РегистрыСведений.ДоступныеОстаткиТоваров.ОбработатьДанныеДляПервоначальногоЗаполнения";
	Обработчик.Версия = "11.5.26.65";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9bdc859a-f917-11f0-8de9-0242ac120002");
	Обработчик.Многопоточный = Истина;
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Критичный;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.ДоступныеОстаткиТоваров.ЗарегистрироватьДанныеПервоначальногоЗаполнения";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет регистр сведений ""Доступные остатки товаров"" по данным регистра накопления ""Запасы и потребности"".
		|Данные регистра используются, в частности, для отображения остатков при подборе товаров в документы продажи.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыСведений.ДоступныеОстаткиТоваров.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.ДоступныеОстаткиТоваров.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	
	// Особенность РС "ДоступныеОстаткиТоваров". Он не мигрирует напрямую, а пересчитывается при миграции РН "Запасы и потребности".
	// Текущий обработчик не связан с изменениями РН "Запасы и потребности", поэтому его нужно непосредственно выполнять в подчиненном узле.
	Обработчик.ЗапускатьТолькоВГлавномУзле = Ложь;
	Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Истина;
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыСведений.ДоступныеОстаткиТоваров.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеПервоначальногоЗаполнения(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = "РегистрСведений.ДоступныеОстаткиТоваров";
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", "РегистрСведений.ДоступныеОстаткиТоваров");
	
	// Ранее данные об остатках хранились в регистре сведений РаспределениеЗапасов.
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.Номенклатура КАК Номенклатура,
		|	Таблица.Характеристика КАК Характеристика,
		|	Таблица.Склад КАК Склад,
		|	Таблица.Назначение КАК Назначение
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Таблица
		|ГДЕ
		|	Таблица.СостояниеЗапаса = ЗНАЧЕНИЕ(Перечисление.СостоянияЗапаса.ПустаяСсылка)
		|		И Таблица.Номенклатура.ТипНоменклатуры В(
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|		И ТИПЗНАЧЕНИЯ(Таблица.Склад) = ТИП(Справочник.Склады)
		|		И Таблица.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
	
	РегистрируемыеИзмерения = Запрос.Выполнить().Выгрузить();
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеИзмерения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПервоначальногоЗаполнения(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.ДоступныеОстаткиТоваров";
	
	Если Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра) Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	ПакетнаяОбработкаЗавершиласьНеудачно = Ложь;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Номенклатура.Использование = Истина;
	Набор.Отбор.Характеристика.Использование = Истина;
	Набор.Отбор.Склад.Использование = Истина;
	Набор.Отбор.Назначение.Использование = Истина;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных();
		РаспределениеЗапасов.ДобавитьБлокировки(Блокировка, Неопределено, ТаблицаОбновляемыеДанные, ТаблицаОбновляемыеДанные);
		Блокировка.Заблокировать();
		РезультатРаспределения = РаспределениеЗапасов.ОбновлениеИБПоТовару(ТаблицаОбновляемыеДанные, "ДоступныеОстаткиТоваров");
		ВсегоСтрок = РезультатРаспределения.ДоступныеОстаткиТоваров.Количество();
		АналитикаЕстьВЗаданияхКРасчету = Истина;
		Для Индекс = 0 По ВсегоСтрок - 1 Цикл
			СтрокаТаблицы = РезультатРаспределения.ДоступныеОстаткиТоваров[Индекс];
			Если Набор.Отбор.Номенклатура.Значение <> СтрокаТаблицы.Номенклатура
					Или Набор.Отбор.Характеристика.Значение <> СтрокаТаблицы.Характеристика
					Или Набор.Отбор.Склад.Значение <> СтрокаТаблицы.Склад
					Или Набор.Отбор.Назначение.Значение <> СтрокаТаблицы.Назначение Тогда
						
						Если Индекс > 0 Тогда
							
							Если АналитикаЕстьВЗаданияхКРасчету Тогда
								ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина, Ложь);
							КонецЕсли;
							Набор.Очистить();
						КонецЕсли;
						
						Набор.Отбор.Номенклатура.Значение = СтрокаТаблицы.Номенклатура;
						Набор.Отбор.Характеристика.Значение = СтрокаТаблицы.Характеристика;
						Набор.Отбор.Склад.Значение = СтрокаТаблицы.Склад;
						Набор.Отбор.Назначение.Значение = СтрокаТаблицы.Назначение;
						
			КонецЕсли;
			
			АналитикаЕстьВЗаданияхКРасчету = СтрокаТаблицы.АналитикаЕстьВЗаданияхКРасчету;
			Если СтрокаТаблицы.ВНаличии = 0 И СтрокаТаблицы.Доступно = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаТаблицы);
			
		КонецЦикла;
		Если ВсегоСтрок > 0 Тогда
			Если АналитикаЕстьВЗаданияхКРасчету Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина, Ложь);
			КонецЕсли;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ПакетнаяОбработкаЗавершиласьНеудачно = Истина;
	КонецПопытки;
	
	Если ПакетнаяОбработкаЗавершиласьНеудачно Тогда
		Для Каждого Строка Из ТаблицаОбновляемыеДанные Цикл
			
			Набор = Неопределено;
			
			НачатьТранзакцию();
			Попытка
				
				Блокировка = Новый БлокировкаДанных();
				РаспределениеЗапасов.ДобавитьБлокировки(Блокировка, Строка, Неопределено, Неопределено);
				Блокировка.Заблокировать();
				
				ЗначениеВТаблице = ТаблицаОбновляемыеДанные.Скопировать(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Строка));
				РезультатРаспределения = РаспределениеЗапасов.ОбновлениеИБПоТовару(ЗначениеВТаблице, "ДоступныеОстаткиТоваров");
				
				Набор = РегистрыСведений.ДоступныеОстаткиТоваров.СоздатьНаборЗаписей();
				Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
				Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
				Набор.Отбор.Склад.Установить(Строка.Склад);
				Набор.Отбор.Назначение.Установить(Строка.Назначение);
				
				Для Каждого СтрокаРезультата Из РезультатРаспределения.ДоступныеОстаткиТоваров Цикл
					
					Если Не Строка.Назначение.Пустая() И СтрокаРезультата.Назначение.Пустая() Тогда
						// Результат расчета по непустым назначениям включает в себя сводные записи по пустому назначению
						// (всем назначениям). Такие записи в набор писать не нужно,
						// они будут рассчитаны и записаны при обработке товара с пустым назначением.
						Продолжить;
					КонецЕсли;
					
					Если СтрокаРезультата.ВНаличии = 0 И СтрокаРезультата.Доступно = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаРезультата);
					
				КонецЦикла;
				
				// Третий параметр "Ложь", так как текущий обработчик не связан с исправлением данных об остатке,
				// а связан с изменением формата хранения данных.
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина, Ложь);
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				Если Набор = Неопределено Тогда
					Набор = СоздатьНаборЗаписей();
					Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
					Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
					Набор.Отбор.Склад.Установить(Строка.Склад);
					Набор.Отбор.Назначение.Установить(Строка.Назначение);
				КонецЕсли;
				ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Набор);
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
